#+TITLE: Emacs configuration file
#+AUTHOR: Ryan Cummings
#+LATEX_HEADER: \usepackage{parskip}
#+LATEX_HEADER: \usepackage{inconsolata}
#+LATEX_HEADER: \usepackage[utf8]{inputenc}
#+STARTUP: overview
** Yasnippet
#+BEGIN_SRC emacs-lisp
  (use-package yasnippet
    :bind
    ("C-c y s" . yas-insert-snippet)
    ("C-c y v" . yas-visit-snippet-file)
    ("C-;" . yas-expand)
    :config
    (add-to-list 'yas-snippet-dirs "~/.emacs.d/snippets")
    (yas-global-mode 1))
#+END_SRC

#+RESULTS:
: #s(hash-table size 65 test eql rehash-size 1.5 rehash-threshold 0.8125 data (:use-package (24891 64249 570004 629000) :init (24891 64249 569859 808000) :config (24891 64249 569837 294000) :config-secs (0 0 2099 826000) :init-secs (0 0 2129 633000) :use-package-secs (0 3 140824 403000)))

